Product - GST/sample messages/body-gst-returnstatus-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/RetrieveStatus</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:RetrieveStatus xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnStatusRequestMsg>
                <ret1:RetrieveStatusRequestWrapper xmlns:ret1="https://services.ird.govt.nz/GWS/Returns/:types/RetrieveStatusRequest">
                    <ret2:retrieveFormInfoRequest xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>1.0</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="ACCIRD">123039858</com:identifier>
                        <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">GST</com:accountType>
                        <ret2:periodEndDate>2017-07-31</ret2:periodEndDate>
                        <ret2:majorFormType>GST</ret2:majorFormType>
                    </ret2:retrieveFormInfoRequest>
                </ret1:RetrieveStatusRequestWrapper>
            </ret:ReturnStatusRequestMsg>
        </ret:RetrieveStatus>
    </soap:Body>
</soap:Envelope>